app/commands/authenticate_customer.rb

  def customer
    if(email == 'anon@anon.com')
      return customer = Customer.find_by_email('anon@anon.com')
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "anon@anon.com"], ["LIMIT", 1]]